xiao6hu/test01/USB_MIDI_UC_OS2_20191123/2.9.0/CMSIS/Driver/EMAC_STM32F2xx.c
  #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
    /* Configure Ethernet pins */
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF11_ETH;

    for (io = eth_pins; io != &eth_pins[sizeof(eth_pins)/sizeof(ETH_PIN)]; io++) {
      Enable_GPIO_Clock (io->port);
      GPIO_InitStruct.Pin = io->pin;
      HAL_GPIO_Init (io->port, &GPIO_InitStruct);
    }
  #else
    heth.Instance = ETH;
  #endif

  /* Clear control structure */
  memset ((void *)&Emac, 0, sizeof (EMAC_CTRL));

  Emac.cb_event = cb_event;
  Emac.flags    = EMAC_FLAG_INIT;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t Uninitialize (void)
  \brief       De-initialize Ethernet MAC Device.
  \return      \ref execution_status
*/
static int32_t Uninitialize (void) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
  const ETH_PIN *io;

  /* Unconfigure ethernet pins */
  for (io = eth_pins; io != &eth_pins[sizeof(eth_pins)/sizeof(ETH_PIN)]; io++) {
    HAL_GPIO_DeInit(io->port, io->pin);
  }
#else
  heth.Instance = NULL;
#endif
  Emac.flags &= ~EMAC_FLAG_INIT;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t PowerControl (ARM_POWER_STATE state)
  \brief       Control Ethernet MAC Device Power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t PowerControl (ARM_POWER_STATE state) {
  uint32_t hclk, clkdiv;

  if ((state != ARM_POWER_OFF)  && 
      (state != ARM_POWER_FULL) && 
      (state != ARM_POWER_LOW)) {
    return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  switch (state) {
    case ARM_POWER_OFF:
      /* Enable Ethernet clocks */
      __HAL_RCC_ETHMAC_CLK_ENABLE();
      __HAL_RCC_ETHMACTX_CLK_ENABLE();
      __HAL_RCC_ETHMACRX_CLK_ENABLE();
      #if (EMAC_TIME_STAMP)
      __HAL_RCC_ETHMACPTP_CLK_ENABLE();
      #endif

      /* Reset Ethernet MAC peripheral */
      __HAL_RCC_ETHMAC_FORCE_RESET();
      __NOP(); __NOP(); __NOP(); __NOP();
      __HAL_RCC_ETHMAC_RELEASE_RESET();

      #if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
        if (heth.Instance != NULL) {
          HAL_ETH_MspDeInit (&heth);
        }
      #else
      /* Disable ethernet interrupts */
      NVIC_DisableIRQ(ETH_IRQn);
      ETH->DMAIER  = 0U;
      ETH->PTPTSCR = 0U;

      /* Disable Ethernet clocks */
      __HAL_RCC_ETHMAC_CLK_DISABLE();
      __HAL_RCC_ETHMACTX_CLK_DISABLE();
      __HAL_RCC_ETHMACRX_CLK_DISABLE();
      #if (EMAC_TIME_STAMP)
      __HAL_RCC_ETHMACPTP_CLK_DISABLE();
      #endif
      #endif

      Emac.flags &= ~EMAC_FLAG_POWER;
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_POWER_FULL:
      if ((Emac.flags & EMAC_FLAG_INIT)  == 0U) {
        /* Driver not initialized */
        return ARM_DRIVER_ERROR;
      }
      if ((Emac.flags & EMAC_FLAG_POWER) != 0U) {
        /* Driver already powered */
        break;
      }
      #if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
        HAL_ETH_MspInit (&heth);
      #else
      /* Enable Ethernet clocks */
      __HAL_RCC_ETHMAC_CLK_ENABLE();
      __HAL_RCC_ETHMACTX_CLK_ENABLE();
      __HAL_RCC_ETHMACRX_CLK_ENABLE();
      #if (EMAC_TIME_STAMP)
      __HAL_RCC_ETHMACPTP_CLK_ENABLE();
      #endif
      #endif

      /* Soft reset MAC DMA controller */
      ETH->DMABMR |= ETH_DMABMR_SR;
      while (ETH->DMABMR & ETH_DMABMR_SR) {
        ; /* Wait until software reset completed */
      }

      #if ((EMAC_CHECKSUM_OFFLOAD != 0) || (EMAC_TIME_STAMP != 0))
      /* Enhanced descriptor enable */
      ETH->DMABMR |= ETH_DMABMR_EDE;
      #endif

      /* MDC clock range selection */
      hclk = HAL_RCC_GetHCLKFreq();

      if (hclk >= 100000000U) {
        clkdiv = ETH_MACMIIAR_CR_Div62;
      } else if (hclk >= 60000000U) {
        clkdiv = ETH_MACMIIAR_CR_Div42;
      } else if (hclk >= 35000000U) {
        clkdiv = ETH_MACMIIAR_CR_Div26;
      } else if (hclk >= 25000000U) {
        clkdiv = ETH_MACMIIAR_CR_Div16;
      } else {
        /* HCLK is too slow for Ethernet */
        return (ARM_DRIVER_ERROR);
      }
      ETH->MACMIIAR = clkdiv;

      /* Initialize MAC configuration */
      ETH->MACCR   = ETH_MACCR_ROD | 0x00008000U;

      /* Initialize Filter registers */
      ETH->MACFFR  = ETH_MACFFR_BFD;
      ETH->MACFCR  = ETH_MACFCR_ZQPD;

      /* Initialize Address registers */
      ETH->MACA0HR = 0U; ETH->MACA0LR = 0U;
      ETH->MACA1HR = 0U; ETH->MACA1LR = 0U;
      ETH->MACA2HR = 0U; ETH->MACA2LR = 0U;
      ETH->MACA3HR = 0U; ETH->MACA3LR = 0U;

      /* Mask timestamp interrupts */
      ETH->MACIMR |= ETH_MACIMR_TSTIM | ETH_MACIMR_PMTIM;

      /* Initialize DMA Descriptors */
      init_rx_desc ();
      init_tx_desc ();

      /* Enable Rx interrupts */
      ETH->DMASR  = 0xFFFFFFFFU;
      ETH->DMAIER = ETH_DMAIER_NISE | ETH_DMAIER_RIE | ETH_DMAIER_TIE;

      #if (EMAC_TIME_STAMP)
      /* Set clock accuracy to 20ns (50MHz) or 50ns (20MHz) */
      if (hclk >= 51000000) {
        ETH->PTPSSIR = 20;
        ETH->PTPTSAR = (50000000ull << 32) / hclk;
      }
      else {
        ETH->PTPSSIR = 50;
        ETH->PTPTSAR = (20000000ull << 32) / hclk;
      }

      ETH->PTPTSCR = ETH_PTPTSSR_TSSIPV4FE | ETH_PTPTSSR_TSSIPV6FE | ETH_PTPTSSR_TSSSR |
                                                                     ETH_PTPTSCR_TSARU |
                                                                     ETH_PTPTSCR_TSFCU |
                                                                     ETH_PTPTSCR_TSE;
      Emac.tx_ts_index  = 0U;
      #endif

      /* Disable MMC interrupts */
      ETH->MMCTIMR = ETH_MMCTIMR_TGFM  | ETH_MMCTIMR_TGFMSCM | ETH_MMCTIMR_TGFSCM;
      ETH->MMCRIMR = ETH_MMCRIMR_RGUFM | ETH_MMCRIMR_RFAEM   | ETH_MMCRIMR_RFCEM;

      #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
      NVIC_ClearPendingIRQ (ETH_IRQn);
      NVIC_EnableIRQ (ETH_IRQn);
      #endif

      Emac.frame_end = NULL;
      Emac.flags    |= EMAC_FLAG_POWER;
      break;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t GetMacAddress (ARM_ETH_MAC_ADDR *ptr_addr)
  \brief       Get Ethernet MAC Address.
  \param[in]   ptr_addr  Pointer to address
  \return      \ref execution_status
*/
static int32_t GetMacAddress (ARM_ETH_MAC_ADDR *ptr_addr) {
  uint32_t val;

  if (ptr_addr == NULL) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
    return ARM_DRIVER_ERROR;
  }

